blog/2017/10/04/literate-dotfiles/index.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <title>Literate Dotfiles - Aaron Kuehler</title>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="author" content="Aaron Kuehler" />
    <meta name="description" content="An attempt to bring order and maintainability to user environment configuration" />
    <meta name="keywords" content="literate programming, dotfiles, configuration, emacs, org-mode, org-babel" />
    <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Zilla+Slab&display=swap" media="none" onload="if(media!='all')media='all'">
    <noscript><link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Zilla+Slab&display=swap"></noscript>
    <link rel="stylesheet" href="/media/css/main.css" type="text/css" media="none" onload="if(media!='all')media='all'">
    <noscript><link rel="stylesheet" href="/media/css/main.css" type="text/css"></noscript>
    <link rel="stylesheet" href="/media/css/prettify.css" type="text/css" media="none" onload="if(media!='all')media='all'">
    <noscript><link rel="stylesheet" href="/media/css/prettify.css" type="text/css"></noscript>
  </head>

  <body>
    <a href="#main">skip to main content</a>
<header role="banner" class="masthead navigation">
  <div class="navigation-wrapper">
    <h1>Aaron Kuehler</h1>
    <p><span class="visually-hidden">Subtitle: </span>80% Scientist, 20% Artist. Theorist and Practitioner.</p>
    <nav role="navigation" aria-label="contents">
      <ul class="navigation-menu show">
        <li><a href="/">Home</a></li>
          <li class="nav-link"><a href="/blog/">Blog</a></li>
        <li><a href="/tags/">Tags</a></li>
        <li><a href="https://github.com/indiebrain">GitHub</a></li>
        <li><a href="/rss.xml">RSS</a></li>
      </ul>
    </nav>
  </div>
</header>

    <main id="main">
<div>
<div class="post">
<h1>Literate Dotfiles</h1>

<div id="outline-container-org924aa36" class="outline-2">
<h2 id="org924aa36">Motivation</h2>
<div class="outline-text-2" id="text-org924aa36">
<blockquote>
<p>
Let us change our traditional attitude to the construction of programs:
Instead of imagining that our main task is to instruct a computer what
to do, let us concentrate rather on explaining to human beings what we
want a computer to do.
</p>
</blockquote>

<p>
In <a href="http://www.literateprogramming.com/knuthweb.pdf">Donald Knuth's 1984 paper "Literate Programming"</a>, he argued that code
is not enough. That is to say it is not enough to only tell a
computational device how to behave. The cognitive energy of the humans
who maintain such code also need to be considered. Such was the
conundrum I found myself in while trying to maintain my 'dotfiles' - my
user-specific system configuration files for *nix-like hosts. I've
struggled to find a balance of organization, readability, and
documentation.
</p>

<p>
Early on, I treated these configuration files as write-only repositories
of code snippets. As a result, they were difficult to reason about so I
didn't try to change them too often. They were 'code' in the deepest
sense of the word - I never intended them to read well. As such, the few
times a friend or colleague would ask about a particular piece of
behavior while pairing, it was almost impossible to discuss with
colleagues - the configuration itself was a lousy example.
</p>
</div>
</div>

<div id="outline-container-orgc58f97c" class="outline-2">
<h2 id="orgc58f97c">A step toward literacy</h2>
<div class="outline-text-2" id="text-orgc58f97c">
<p>
What if, with a little reorganization, we could document intent, in a
human readable format, and provide executable examples from which our
actually-on-disk dotfiles could be generated?
</p>

<p>
Enter Emacs' Babel package; a sub-system of <a href="http://orgmode.org/">Emacs org-mode</a> which allows
us to embed code blocks inside of natural language documents. Exporting
the code is great, but what about the reader's experience? Naturally,
emacs handles the display of org-mode documents rather well. When
working with the dotfiles org-mode document, one has access to all of
the normal Emacs and org-mode document editing features: org's easy to
use document syntax, section/hader folding, search, etc. But what about
our non-emacs friends? Popular git forges like Github and Gitlab have us
covered. In addition to markdown, org-mode tends to be supported as a
source format for documentation and static HTML generation on popular
code hosting platforms. As a result, the woven/human-readable version of
the dotfiles render rather well.
</p>
</div>
</div>

<div id="outline-container-orgb3bbbe3" class="outline-2">
<h2 id="orgb3bbbe3">Making the move</h2>
<div class="outline-text-2" id="text-orgb3bbbe3">
<p>
Organizing a scattered collection of dotfiles configuration into a
literate document and generating/tangling the code examples into usable
configuration can be described as follows:
</p>

<ol class="org-ol">
<li>First, organize and copy each logical group of configuration code the
existing dotfiles into org-mode code blocks.</li>
<li>Then add intention revealing documentation for each block.</li>
<li>Next, add metadata about the tangling/export process. These
properties tell babel that the code blocks under the <code>.bashrc</code> header
should be exported to the file at <code>~/.bashrc</code>.</li>
<li>And finally we need to tangle/export the code by running <code>M-x
   org-babel-tangle</code> - in my dotfiles repository I include a <a href="https://github.com/indiebrain/.files/blob/71d302e097483dd878e76ff4cf53372bdf184523/install.sh">dotfiles
generation and installation script</a> that will automatically
tangle/export all of the code blocks.</li>
</ol>
</div>
</div>

<div id="outline-container-org0795f65" class="outline-2">
<h2 id="org0795f65">Conclusion</h2>
<div class="outline-text-2" id="text-org0795f65">
<p>
I've used this literate approach to generate my <a href="https://github.com/indiebrain/.files/">personal dot-files</a> and
<a href="https://github.com/indiebrain/.files/tree/3f3231bc73651018a8faf717fd72a5765d148c25/emacs/.emacs.d">Emacs configuration</a> for a few months. I find it to be much easier to
manage and reason about and maintain confidently. Though I wouldn't
recommend Literate Programming for every task, I find that "prose first
development" works great for clarifying the scope and intent of a task
when modifying system configuration.
</p>

<p>
UPDATES:
</p>

<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">&lt;2021-07-11 Sun&gt; </span></span> Update links to Emacs configuration. Since the
original posting of this article, I've consolidated my .emacs.d
configuration into my .files repository - IE they're all one
repository. This change updates the hyperlinks to make sure the reader
lands in the correct location.</li>
</ul>
</div>
</div>

</div>
</div>
    <div>
      <div class="post-meta">
        <div class="post-publication-info">
          <span title="post date" class="post-info">2017-10-04</span>
          <span title="author" class="post-info">Aaron Kuehler</span>
        </div>
        <div class="post-tags">
          <span title="tags" class="post-info"><a href="/tags/software/">software</a>, <a href="/tags/devops/">devops</a></span>
        </div>
      </div>
      <script src="//code.jquery.com/jquery-latest.min.js"></script>
      <script src="https://cdnjs.cloudflare.com/ajax/libs/prettify/r298/prettify.js"></script>
      <script src="/media/js/main.js"></script>
      <div class="footer">
        <p>
          Copyright &copy; 2012 - <span id="footerYear"></span> Aaron Kuehler
          <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
        </p>
      </div>
    </div>

    </main>
  </body>
</html>
